BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
#include <Arduino.h>
#include <ArduinoJson.h>
#include <time.h>

#include <ESP8266WiFi.h>
#include <ESP8266WiFiMulti.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>

#include <datalogger_config.h>  //Configuration parameters.

#include <Hash.h>
#include <WebServerFiles.cpp>

#include <FS.h>           //SPIFFS libraries.
#include <rtc_memory.hpp>
#include <statemachine.hpp>


//----------------------------------------------------------------------------------------
DHT dht22_sensor_1(DHT_SENSOR_1_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_2(DHT_SENSOR_2_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_3(DHT_SENSOR_3_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_4(DHT_SENSOR_4_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object

//---------------------------------------------------------------------------------------------------------------------
//Initialization functions.
void portInit(void);
uint8_t getBatteryLevel(void);           //Get battery level percentage (0 to 100%).
void setBatteryState(uint8 state=ON);     //Connects or disconnects battery.
bool checkBattery(void);
void setSensorPower(unsigned char state);
void wifiTurnOn(void);
void wifiTurnOff(void);
void goDeepSleep(uint64_t time);
bool isCharging(void);
bool reedSwitchIsPressed(void);

void* stringToArray(std::string origin_string);
int32_t generateMeasurementValue(unsigned char type, float value);
String formatMeasurementValue(unsigned char type, float value);  //Converts measurements into valid format
String generatePOSTRequest( void* data, uint16_t packets);
uint16_t sendMeasurements(String request);
Measurement getMeasurements(void);
uint32_t getServerTimeUnix(void);

bool writeDataToFlash(String path, void* data, unsigned int bytes);
bool readDataFromFlash(String path, uint32_t index, void* data, unsigned int bytes);
bool archiveWrite(void* data, uint16_t bytes);
bool archiveRead(void* data, uint32_t first_packet, uint32_t last_packet);
uint32_t archiveGetPointer(void);
bool initglobals(void);

//Functions to handle web server
void handleHome(void);
void handleChangeNetworkConfig(void);
void handleChangeServerConfig(void);
unsigned char runWebServer(void);
unsigned char handleFormatRam(void);
unsigned char handleFormatFlash(void);
//---------------------------------------------------------------------------------------------------------------------

typedef struct{
  char server_ap_ssid[31];
  char server_ap_pass[31];   
  char server_ip[16];
  uint16_t server_port;
  char local_ip[16];      //192.168.255.255 ->15 + NULL
  char wifi_security_type[10];   //// enum wifi_security_type{WEP, WPA, WPA2, WPA2E};

  uint8_t   connection_retry;     //amount of retrials to connect in case of failure. (def:1).
  uint32_t  connection_timeout;   //milliseconds to try connecting  (def:5000).
  uint32_t  response_timeout;     //milliseconds to await response  (def:2000).
  // todo: evaluate which WPA2-Enterprise parameters are needed.
  
  uint16_t id_sensor_1;     //Parameters to put into POST request.
  uint16_t id_sensor_2;
  uint16_t id_sensor_3;
  uint16_t id_sensor_4;
  uint16_t id_transceiver;    

  uint16_t  sample_time;    //lapse between measurements (in seconds)

} Config_globals;

ESP8266WiFiMulti WiFiMulti;             //Wifi client side handle.
ESP8266WebServer server(8080);          //Server for configuration.
StateMachine statem(STATE_WAKE);  //Create StateMachine class object. Starts at wake.
RtcMemory rtcmem;                       //Object to handle rtc memory.
Config_globals config_globals;


void setup() {
  portInit();
  wifiTurnOff();
  Serial.begin(115200);
  initglobals();

  Serial.printf("\n config_globals.id_sensor_1 =%d", config_globals.id_sensor_1);
  Serial.printf("\n config_globals.id_sensor_2 =%d", config_globals.id_sensor_2);
  Serial.printf("\n config_globals.local_ip =%s", config_globals.local_ip);
  Serial.printf("\n config_globals.server_ap_ssid =%s", config_globals.server_ap_ssid);
  Serial.printf("\n config_globals.server_ap_pass =%s", config_globals.server_ap_pass);
  
  
  SPIFFS.begin();

  // handleFormatFlash();  //FOR TESTING ONLY!
  // handleFormatRam();

//////////////////////////////////////////////////////////////

 
  
/*   // DEBUG: Write arbitrary data to  RTC memory.
      //Get measurements...
    Measurement m;    
    m.timestamp=1234567890+millis(); //Put current timestamp
    m.id_sensor[0]=1;   
    m.id_sensor[1]=2; 
    m.id_sensor[2]=3; 
    m.id_sensor[3]=4;
    m.temperature[0]=190; 
    m.temperature[1]=195;
    m.temperature[2]=195;
    m.temperature[3]=192;
    m.humidity[0]=56; 
    m.humidity[1]=54; 
    m.humidity[2]=54; 
    m.humidity[3]=52;  */
    
  //   //Save measurements into temporary memory.
  //   if ( ! rtcmem.saveMeasurements(&m, sizeof(m))) //If data is not saved correctly in RAM...
  //   {
  //     Serial.printf(" \n -------- RTC memory full. Saving data to flash and clearing memory... --------");
  //     /* save to flash, clear RAM and then rewrite to it */
      
  //     uint8 buf[(RTC_MEMORY_MEASUREMENTS_END_BLOCK - RTC_MEMORY_MEASUREMENTS_START_BLOCK)*4];   //Temporary buffer to read measurements
  //     rtcmem.readData(RTC_MEMORY_MEASUREMENTS_START_BLOCK, &buf, (RTC_MEMORY_MEASUREMENTS_END_BLOCK - RTC_MEMORY_MEASUREMENTS_START_BLOCK)*4);

  //     // writeDataToFlash(MEASUREMENTS_FILE_NAME, buf, sizeof(buf)); //Save measurements to flash.
  //     archiveWrite(buf, sizeof(buf));
  //     rtcmem.clearMeasurements();   //Clears rtc memory.

  //     m.timestamp=millis();   //Put actual time for the moment the pending to store measurement is stored.
  //     rtcmem.saveMeasurements(&m, sizeof(m));   //Saves current measurement.
  
  //   }

  
  
  

}


void loop() {

  //Make method to detect if power was disconnected (to automatically call method
  // recoverVariables() and initialize rtc memory properly.)
  
  if(statem.getState() == STATE_WAKE){
    
    if(statem.stateInit()){ //State initialization.
       Serial.print("\n --- State: STATE_WAKE ---");
      wifiTurnOff();
      // if(checkBattery()){
      if(checkBattery()){ //If enough battery remaining...
         //Checks if device has lost power supply.
        if(rtcmem.checkPowerdown()){
          setBatteryState(ON);  //Connect battery.
          if(rtcmem.initialize())  //Recovers variables
            Serial.print("\nDevice powered off. RTC memory recovered correctly.");
          else  
          Serial.print("\n RTC memory recovery failed.");
        }
        
        /*RTC and external interrupt are not differenced once 
        the device goes into deep sleep. It will always detect 
        as "RTC interrupt".*/
        /*Use the previous detection mode (reedSwitchIsPressed())*/

       
        if(reedSwitchIsPressed()){  //if external interrupt (switch was pressed)...
          Serial.print("\n\nExternal interrupt.");
          
