BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
          /*
              To solve: When waking up from switch (not RTC interrupt), the time will unsincronize
              as the device will go deep sleep from another full hour after that.

              This affects only when the switch being pressed is not detected -> put capacitor to hold
              the signal the time needed to boot.

              A more effective way would be to get the actual value of RTC counter (in milliseconds) and compare
              if it has reach the "timer module" -> if it does, this means the wake up was made by the timer and
              not from the switch.
          */  
          if( ! isCharging()){   //If charger is not connected...
            statem.setState(STATE_FORCE_MEASUREMENT);    //Forces measurement.
          }
          else  //If charger is connected...
          {
            Serial.printf("\n awaiting hold for config mode...");
            delay(SWITCH_HOLD_TIME_CONFIG);  //Waits for a moment...
            if(reedSwitchIsPressed()){       //If switch is still pressed...
              statem.setState(STATE_CONFIGURATION); //Go to configuration mode.
            }
            else    //if not hold...
              statem.setState(STATE_FORCE_MEASUREMENT);  //Forces measurement.
          }
        }  
        else{   //If switch was not pressed (RTC interrupt.)
          Serial.print("\n\nRTC interrupt.");
          statem.setState(STATE_GET_MEASUREMENTS);
        }
      }
      else      //If out of battery.
      {
        statem.setState(STATE_SEALED);    //Turn off.
      }
    }  
  } 
  else if (statem.getState() == STATE_GET_MEASUREMENTS){
    
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_GET_MEASUREMENTS ---");

      Serial.print("\n Obtaining measurements... ");
      
      Measurement m = getMeasurements();
    
      //Save measurements into temporary memory.
      if ( ! rtcmem.saveMeasurements(&m, sizeof(m))) //If data is not saved correctly in RAM...
      {
        Serial.printf(" \n -------- RTC memory full. Saving data to flash and clearing memory... --------");
        /* save to flash, clear RAM and then rewrite to it */
        uint8 buf[288];   //Temporary buffer to read measurements.

        uint16_t packets = rtcmem.readMeasurements(buf);
        Serial.printf("\n    Measurements read from RTC / amount=%d ", packets);
        archiveWrite(buf, sizeof(Measurement)*packets);   //Write data into archive (flash memory).
    
        rtcmem.clearMeasurements();               //Clears rtc memory.
        rtcmem.saveMeasurements(&m, sizeof(m));   //Saves current measurement.

        statem.setState(STATE_TRANSMISSION);   //Transmit pending data.
      }
      statem.setState(STATE_DEEP_SLEEP);    //Goes deep sleep...
    }
    
  }
  else if (statem.getState() == STATE_SAVE_MEASUREMENTS){
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_SAVE_MEASUREMENTS ---");

    }
    

  }
  else if (statem.getState() == STATE_TRANSMISSION){
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_TRANSMISSION ---");

      // wifiTurnOn(); 


      uint8 buf[576]; 
      // archiveRead(buf,rtcmem.rwVariables().archive_sent_pointer, rtcmem.rwVariables().archive_saved_pointer);
      archiveRead(buf,0,24);
      // generatePOSTRequest(buf, 2);
      // generatePOSTRequest(buf, 24);

      sendMeasurements(generatePOSTRequest(buf, 2));

      rtcmem.var.archive_sent_pointer= 1;
      rtcmem.rwVariables();

      statem.setState(STATE_DEEP_SLEEP);
    }
  }
  else if (statem.getState() == STATE_FORCE_MEASUREMENT){
    if(statem.stateInit()){
      Serial.print("\n --- State: FORCE STATE_FORCE_MEASUREMENT ---");
      Serial.print("\n Obtaining measurements... ");
      
      Measurement m = getMeasurements();
      //   //Save measurements into temporary memory.
      if ( ! rtcmem.saveMeasurements(&m, sizeof(m))) //If data is not saved correctly in RAM...
      {
        Serial.printf(" \n -------- RTC memory full. Saving data to flash and clearing memory... --------");
        /* save to flash, clear RAM and then rewrite to it */
        
        uint8 buf[288];   //Temporary buffer to read measurements.
        uint16_t packets = rtcmem.readMeasurements(buf);
        Serial.printf("\n    Measurements read from RTC / amount=%d ", packets);
        archiveWrite(buf, sizeof(Measurement)*packets);   //Write data into archive (flash memory).
      /* ////////////////// For testing //////////////////
        Measurement m;
        for (int16_t i = -13; i < -1; i++)
        {
          archiveRead(&m, rtcmem.rwVariables().archive_saved_pointer+i, rtcmem.rwVariables().archive_saved_pointer+i);
          Serial.printf("\nRead measurements from flash:   (packet: %d)   data: \n",rtcmem.rwVariables().archive_saved_pointer+i);
          Serial.printf("\ntimestamp: %d\n",m.timestamp);
          Serial.printf("id_sensor: [%d,%d,%d,%d] \n",m.id_sensor[0],m.id_sensor[1],m.id_sensor[2],m.id_sensor[3]);
          Serial.printf("temperature: [%d,%d,%d,%d] \n",m.temperature[0],m.temperature[1],m.temperature[2],m.temperature[3]);
          Serial.printf("humidity: [%d,%d,%d,%d] \n",m.humidity[0],m.humidity[1],m.humidity[2],m.humidity[3]);
          Serial.print("----------------------------------\n\n");
        }
        //////////////////////////////////////////////////////
      */
        rtcmem.clearMeasurements();   //Clears rtc memory.
        rtcmem.saveMeasurements(&m, sizeof(m));   //Saves current measurement.
      }
      statem.setState(STATE_TRANSMISSION);   //Transmit pending data.

      
    }
  }
  else if (statem.getState() == STATE_CONFIGURATION){
   
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_CONFIGURATION ---");

      digitalWrite(15,HIGH);      //DEBUG.
      runWebServer();   //Run web server.
      // rtcmem.safeDisconnect();   //Better use this when entering configuration mode (save variables)
    }

    server.handleClient(); //Handling of incoming requests
  }
  else if (statem.getState() == STATE_SEALED){
    if(statem.stateInit()){
      Serial.print("\n --- State: STATE_SEALED ---");
      rtcmem.safeDisconnect();    //Saves variables...
      //Log power failure.
      delay(100);     //100ms delay.
      setBatteryState(OFF); //Disconnect battery, device will turn off.
    }

