BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
    }
  }
  return false;
}

bool archiveRead(void* data, uint32_t first_packet, uint32_t last_packet){

  //Read archive from one packet index to other. "start index" is the first reference and "end_index" the last one.
  //This function will copy the content from the first packet in the archive to the last one, including both
  //mentioned packets and each one between them, in the order they are saved into the archive.
  //If both indexes are equal, only one packet is read.
    
  //Validate that the index values are both multiple of RTC_MEMORY_MEASUREMENT_BLOCK_SIZE (24)!!
  
  uint32_t packet_amount = 1+(last_packet-first_packet);
  uint32_t total_bytes = packet_amount*RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*RTC_MEMORY_BLOCK_SIZE;
  if ( first_packet >= 0 && last_packet >= 0 && (packet_amount >= 0) && last_packet < archiveGetPointer())  //If packets indexes are valid...
  {
    File file = SPIFFS.open(MEASUREMENTS_FILE_NAME, "r");   //Open file
    if (file){        //If file opens correctly...
      //If file end is not going to be reached...
      if( file.available() >= total_bytes )
      { 
          file.seek(first_packet*sizeof(Measurement),
                    fs::SeekSet);    //Move the cursor to the first_packet position.
          Serial.printf("archiveRead() first_packet: %d, last_packet: %d,   seek value:%d", first_packet, last_packet, first_packet*sizeof(Measurement));
          Serial.printf("\nData read from archive:   (currpos = %d)\n", file.position());   //For debugging...
          
          for (uint32 i = 0; i < total_bytes; i++)    //Writes data output buffer
          {
            ((uint8_t*)data)[i] = file.read(); 
            Serial.printf("%X ",((uint8_t*)data)[i]); //Prints file content.                //For debugging...  
          }
      }
      file.close();    //Close file.
      return true;
    }
    else{         //If file fails to open...
      Serial.println("Failed to open file for reading");
      return false;
    }
  }
  else
  {
    return false;
  }
}

uint32_t archiveGetPointer(void){
  //Return position of pointer, where next packet will be written.
  uint32_t size = 0;
  File file = SPIFFS.open(MEASUREMENTS_FILE_NAME, "r");   //Open file
    if (file){        //If file opens correctly...
      size = file.size();
      file.close();    //Close file.
      // Serial.printf("\nFile size = %d)\n", size);   //For debugging...
    }
  return (1+size/(RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*RTC_MEMORY_BLOCK_SIZE));   
}

Measurement getMeasurements(void){
  //Turns sensors on, take measurements, format them and return.
  Measurement m;
  dht22_sensor_1.begin();           //Initializes objects.
  dht22_sensor_2.begin();
  dht22_sensor_3.begin();
  dht22_sensor_4.begin();

  setSensorPower(ON);
  delay(1000);  
  //GET MEASUREMENTS
  m.timestamp=rtcmem.getCurrentTime();  //Put current timestamp
  m.id_sensor[0] = 1;   //Read sensor number from configuration file.
  m.id_sensor[1] = 2; 
  m.id_sensor[2] = 3; 
  m.id_sensor[3] = 4;
  m.temperature[0] = generateMeasurementValue(TEMPERATURE, dht22_sensor_1.readTemperature());
  m.temperature[1] = generateMeasurementValue(TEMPERATURE, dht22_sensor_2.readTemperature());
  m.temperature[2] = generateMeasurementValue(TEMPERATURE, dht22_sensor_3.readTemperature());
  m.temperature[3] = generateMeasurementValue(TEMPERATURE, dht22_sensor_4.readTemperature());
  m.humidity[0] = generateMeasurementValue(HUMIDITY, dht22_sensor_1.readHumidity());; 
  m.humidity[1] = generateMeasurementValue(HUMIDITY, dht22_sensor_2.readHumidity());; 
  m.humidity[2] = generateMeasurementValue(HUMIDITY, dht22_sensor_3.readHumidity());; 
  m.humidity[3] = generateMeasurementValue(HUMIDITY, dht22_sensor_4.readHumidity());;  

  setSensorPower(OFF);

  return(m);
}

String generatePOSTRequest( void* data, uint16_t packets){
  /*This function receives data saved to flash (array) and generates the POST request to send
    it to the server, which is returned.
    Necessary data:
  */
  
  String request="";  //Initialize empty string.
  String values_timestamp=  "[";
  String values_id_sensor=  "[";
  String values_temperature="[";
  String values_humidity=   "[";

  Measurement m;  //Temporary variable.
  for (uint16_t p = 0; p < packets; p++){ //For each packet...
    memcpy(&m, data+(p*sizeof(m)), sizeof(m));    //Copies one packet into the temporary memory.

    for (uint8_t s = 0; s < DATALOGGER_SENSOR_COUNT; s++){ //For each sensor...
      values_timestamp+= (String)m.timestamp;
      values_id_sensor  +=(String)m.id_sensor[s];
      values_temperature+=(String)m.temperature[s];
      values_humidity   +=(String)m.humidity[s];

      if( p < packets-1){   //If it is not the last packet...
          values_timestamp+=  ",";          
          values_id_sensor+=  ",";
          values_temperature+=",";
          values_humidity+=   ",";
      }
      else{   //If it is the last element, closes the bracket.
        if(s < DATALOGGER_SENSOR_COUNT - 1){
          values_timestamp+=  ",";          
          values_id_sensor+=  ",";
          values_temperature+=",";
          values_humidity+=   ",";
        }  
        else{
          values_timestamp+=  "]";      
          values_id_sensor+=  "]";      
          values_temperature+="]";      
          values_humidity+=   "]"; 
        } 
      }
    }
  }
  
  request += "id_transceiver=1";      //? symbol deleted as it is not needed into POST method.
  request += "&battery_level="+(String)getBatteryLevel();
  request += "&timestamp="+   values_timestamp;
  request += "&id_sensor="+   values_id_sensor;
  request += "&temperature="+ values_temperature;
  request += "&humidity="+    values_humidity; 
  
  Serial.print("\n Generated POST request: ");
  Serial.println(request);  
  
  return request;
}

uint16_t sendMeasurements(String request){
    uint32_t start_time = millis();
    bool isconnected=false;

    wifiTurnOn();
    WiFiMulti.addAP(config_globals.server_ap_ssid, config_globals.server_ap_pass);  //Connects to WiFi network.
    
    Serial.print("\nConnecting to server...\n ");
    
