BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
    while(millis() - start_time <= config_globals.connection_timeout || isconnected){
      yield();
      if ((WiFiMulti.run() == WL_CONNECTED)) {
        Serial.printf("\nWiFi Connected!");
        isconnected=true; //Toggle flag.
        
        WiFiClient client;
        HTTPClient http;

        //Generate full URL.
        String url = "http://"+(String)config_globals.server_ip+":"+(String)config_globals.server_port;
        url+=SEND_MEASUREMENTS_URL;
        // url+=request;
        Serial.print("\n url: ");
        Serial.println(url);
      
        Serial.print("\n[HTTP] begin...\n");
        if (http.begin(client, url)) { //Define if route should be defined here.
        
          //Send POST request
          Serial.print("[HTTP] POST...:\n");
          Serial.print(request);
          int httpCode = http.POST( request );
          //int httpCode = http.GET();

          // httpCode will be negative on error
          if (httpCode > 0) {
            // HTTP header has been send and Server response header has been handled
            Serial.printf("[HTTP] POST... code: %d\n", httpCode);
            
            // file found at server
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
              String payload = http.getString();
              Serial.println(payload);
            }

            goDeepSleep(60e6);  //Deep sleep for low power consumption.

          } else {
            Serial.printf("[HTTP] GET failed, error: %s\n", http.errorToString(httpCode).c_str());
            goDeepSleep(60e6);
          }
          http.end();
        } 
        else {
          Serial.printf("[HTTP] Unable to connect\n");
        }
      }
    }

    wifiTurnOff();
    
    if(isconnected)
      Serial.print("\n data sent.");
    else
      Serial.printf("\n Timeout: %dms. Unable to connect. data not sent.", (millis() - start_time));
}

uint32_t getServerTimeUnix(void){
  //Cnnects to server, sends a request and returns unix time in UTC from server.
  return 0;
}

int32_t generateMeasurementValue(unsigned char type, float value){
  int32_t measurement=0; 

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     measurement = (int16_t)(value*10);
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    measurement = (uint8_t)(value);
  }
  return(measurement);
}

String formatMeasurementValue(unsigned char type, float value){  //Converts measurements into valid format
  char measurement [10];  //4B string array for the value.
  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string.

  if (type == TEMPERATURE){
     // -200 ~ 800 -> -20ºC to 80ºC
     itoa((signed short int)(value * 10), measurement, 10);   //Takes the first digit after comma.
  }
  else if (type == HUMIDITY)
  { // 0 ~ 100 ->  0% to 100%
    itoa((unsigned char)(value), measurement, 10);    //Takes only integer part.
  }

  measurement[(sizeof(measurement)-1)] = 0; //Put NULL character at the end of the string
  Serial.printf("\n\nMeasurement:");
  Serial.printf(measurement);
  return( String(measurement) );
}

void* stringToArray(std::string origin_string){
    //This function should return -1 if the size of "a" (destination array) is smaller than "s"
    //to avoid buffer overflow and possible fragmentation faults...
    int string_length = (origin_string.length()) + 1 ;

    char* s = (char*) malloc(string_length);
    strcpy(s, origin_string.c_str());

    return (s);
}

void goDeepSleep(uint64_t time){
  if(time > 3600000000 ) time = 3600000000;  //Maximum 1h (3600 sec).
  
  uint32_t t = time/1000000;
  WiFi.disconnect(true);  //Turns off wifi module, so in the wake up it won't turn on automatically until required.
  delay(1);
  rtcmem.setElapsedTime(t+(millis()/1000));

  Serial.printf("\nGoing deep sleep for %d seconds... ", (t));

  ESP.deepSleep(time, WAKE_RF_DISABLED);  //deep sleeps for 5 seconds...
}

void setSensorPower(unsigned char state){
  if (state == ON)
  {
    digitalWrite(PWR_SENSORS_PIN, LOW);  //Turn sensors supply on.
    // Serial.printf("\nSensors turned on.");
  }
  if (state == OFF)
  {
    digitalWrite(PWR_SENSORS_PIN, HIGH);  //Turn sensors supply off.
    // Serial.printf("\nSensors turned off.");
  }
}

void wifiTurnOff(void){
  WiFi.mode( WIFI_OFF );  //Wifi starts turned off after wake up, in order to save energy.
  WiFi.forceSleepBegin(); 
  delay(1);
}

void wifiTurnOn(void){
  WiFi.forceSleepWake();    //Turns on radio.
  delay(1);   //Necessary delay to settle.
  WiFi.mode(WIFI_STA);  // Bring up the WiFi connection.
  WiFi.persistent(false); //Wifi credentials loaded directly from flash (as specified below) and not overwritten to it.
}

bool initglobals(void){
  /*  Read configuration file (JSON) and load data into Config_globals struct. 
  First load all the data from file into a string, and then parse it to a Json buffer,
  to then extract the values from each keyword.
  If file not found, load default values, defined in this function.
  */

  void* p = &config_globals;
  uint8_t buf[sizeof(Config_globals)]; //temporary buffer.

  File file = SPIFFS.open(CONFIG_FILE_NAME, "r");   //Open file
  if (file){        //If file opens correctly...
     
    Serial.print("\n  Config_globals: ");  
    for (uint16_t i = 0; i < sizeof(buf); i++)
    {
      buf[i] = file.read(); //Copies the read byte 
      Serial.printf("%X ",  buf[i]);
    } 
    memcpy(p, buf, sizeof(buf));  //Copies read data to the variable.
    // rwVariables();  //Stores read data to RTC memory.    ////////////////// REMOVED FOR TESTING ///////////
    return true;
  }
  else{     //Load default values.
    strcpy(config_globals.server_ap_ssid,"DATALOGGER SERVER");
    strcpy(config_globals.server_ap_pass,"!UBA12345!");
    strcpy(config_globals.server_ip, "192.168.137.1");
    strcpy(config_globals.local_ip,"192.168.4.1");
    strcpy(config_globals.wifi_security_type,"WPA2");

    config_globals.server_port=8080;
    config_globals.connection_retry=1;
    config_globals.connection_timeout=5000;
    config_globals.response_timeout=2000;
    config_globals.id_transceiver=1;
    config_globals.id_sensor_1=1;
    config_globals.id_sensor_2=2;
    config_globals.id_sensor_3=3;
    config_globals.id_sensor_4=4;
    config_globals.sample_time=3600;
  }
  return false;
}

//////////////////////////// WEB SERVER FUNCTIONS /////////////////////////////////
unsigned char runWebServer(void){ 

